## CONTENT LIST

1. Importing Libraries
2. Importing Data
3. Wrangling Customer Data
4. Data Quality and Consistency Checks
5. Combine Customer Data with Prepared Data
6. Merging Data

## 1. Importing Libraries

In [22]:
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

## 2. Importing Data

In [23]:
# Importing Customer Data
customer = pd.read_csv(r'C:\Users\heidi\OneDrive\CareerFoundry\Achievement4 Python Fundamentals for Data Analysts\4.2.Jupyter_Fundamentals_and_Python_Data_Types\Instacart Basket Analysis 16-03-2021\02 Data\Original Data\customers_1.csv')

In [24]:
# Creating path
path = (r'C:\Users\heidi\OneDrive\CareerFoundry\Achievement4 Python Fundamentals for Data Analysts\4.2.Jupyter_Fundamentals_and_Python_Data_Types\Instacart Basket Analysis 16-03-2021\02 Data')

## 3. Wrangling Customer Data

In [25]:
df = customer

In [26]:
# Checking Column Names
customer.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [27]:
customer.shape

(206209, 10)

In [28]:
customer.describe()

             user_id            Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

In [29]:
# Determing variable's data types
customer.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   user_id       206209 non-null  int64
 1   First Name    194950 non-null  object
 2   Surnam        206209 non-null  object
 3   Gender        206209 non-null  object
 4   STATE         206209 non-null  object
 5   Age           206209 non-null  int64
 6   date_joined   206209 non-null  object
 7   n_dependants  206209 non-null  int64
 8   fam_status    206209 non-null  object
 9   income        206209 non-null  int64
dtypes: int64(4), object(6)
memory usage: 15.7+ MB

In [30]:
#Changing Data Type of User_ID & Order_id from Numeric to String for Prepared data

customer ['user_id'] = customer['user_id'].astype('int')

Wrangle the data so that it follows consistent logic; for example, rename columns with illogical names and drop columns that don’t add anything to your analysis.

In [31]:
# Rename unintuitive columns
customer.rename(columns = {'STATE' : 'state', 'n_dependants' : 'number_of_dependants', 'fam_status' : 'marital_status', 'income' : 'annual_income', 'Age' : 'customer_age', 'Gender' : 'gender'}, inplace = True)

In [32]:
# Drop unnecessary columns
df = customer.drop(['First Name', 'Surnam', 'date_joined'], axis = 1, inplace = True)

In [33]:
customer.head()

,user_id,gender,state,customer_age,number_of_dependants,marital_status,annual_income
0,26711,Female,Missouri,48,3,married,165665
1,33890,Female,New Mexico,36,0,single,59285
2,65803,Male,Idaho,35,2,married,99568
3,125935,Female,Iowa,40,0,single,42049
4,130797,Female,Maryland,26,1,married,40374

## 4. Data Quality and Consistency Checks
Check for and address missing values and duplicates, and convert any mixed-type data.

In [34]:
# Checking for missing values
customer.isnull().sum()

user_id                 0
gender                  0
state                   0
customer_age            0
number_of_dependants    0
marital_status          0
annual_income           0
dtype: int64

No missing values

In [35]:
df_test = customer

In [36]:
# Check for mixed types
for col in df_test.columns.tolist():
    mixed_types = (df_test[[col]].applymap(type) !=df_test[[col]].iloc[0].apply(type)).any(axis = 1)
    if len (df_test[mixed_types]) > 0:
        print (col)

No mixed_type columns

In [37]:
# Finding duplicates

In [38]:
df_dups = customer[customer.duplicated()]

In [39]:
df_dups

Empty DataFrame
Columns: [user_id, gender, state, customer_age, number_of_dependants, marital_status, annual_income]
Index: []

In [40]:
# Result: No duplicate data in all the columns

In [41]:
customer.shape

(206209, 7)

## 5. Combine Customer Data with Original Data

In [42]:
# Import Original Data
original_data = pd.read_pickle(r'C:\Users\heidi\OneDrive\CareerFoundry\Achievement4 Python Fundamentals for Data Analysts\4.2.Jupyter_Fundamentals_and_Python_Data_Types\Instacart Basket Analysis 16-03-2021\02 Data\Prepared Data\grouping_data_ords_prods_merged_2.pkl')

MemoryError:

In [22]:
df = original_data

NameError: name 'prepared_data' is not defined

In [23]:
original_data.shape

(32399732, 24)

In [24]:
original_data.dtypes

order_id                      int64
user_id                       int64
order_number                  int64
orders_day_of_the_week        int64
order_hour_of_day             int64
days_since_prior_order      float64
product_id                    int64
add_to_cart_order             int64
reordered                     int64
_merge                     category
product_name                 object
aisle_id                      int64
department_id                 int64
prices                      float64
price_range_loc              object
busiest_day                  object
busiest_days                 object
busiest_period_of_day        object
max_order                     int64
loyalty_flag                 object
mean_price_ords             float64
spending_flag                object
order_frequency             float64
customer_frequency_flag      object
dtype: object

In [25]:
original_data['user_id'] = original_data['user_id'].astype('str')

In [26]:
# View output of prepared_data 
original_data.head()

,order_id,user_id,order_number,orders_day_of_the_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,_merge,...,price_range_loc,busiest_day,busiest_days,busiest_period_of_day,max_order,loyalty_flag,mean_price_ords,spending_flag,order_frequency,customer_frequency_flag
0,2539329,1,1,2,8,11.11,196,1,0,both,...,Mid-range product,Regular busy,Regularly busy,Average orders,10,New customer,6.367797,Low spender,20.0,Regular customer
1,2398795,1,2,3,7,15.00,196,1,1,both,...,Mid-range product,Regular busy,Least busy,Average orders,10,New customer,6.367797,Low spender,20.0,Regular customer
2,473747,1,3,3,12,21.00,196,1,1,both,...,Mid-range product,Regular busy,Least busy,Most orders,10,New customer,6.367797,Low spender,20.0,Regular customer
3,2254736,1,4,4,7,29.00,196,1,1,both,...,Mid-range product,Least busy,Least busy,Average orders,10,New customer,6.367797,Low spender,20.0,Regular customer
4,431534,1,5,4,15,28.00,196,1,1,both,...,Mid-range product,Least busy,Least busy,Most orders,10,New customer,6.367797,Low spender,20.0,Regular customer

In [27]:
# View output of customer_data 
customer.head()

,user_id,gender,state,customer_age,number_of_dependants,marital_status,annual_income
0,26711,Female,Missouri,48,3,married,165665
1,33890,Female,New Mexico,36,0,single,59285
2,65803,Male,Idaho,35,2,married,99568
3,125935,Female,Iowa,40,0,single,42049
4,130797,Female,Maryland,26,1,married,40374

In [28]:
customer.shape

(206209, 7)

## 6. Merging Data

In [29]:
# Merge two files
# customer_prepared = pd.merge(prepared_data, customer, on = 'user_id')
df_merged = original_data.merge(customer, on = ['user_id'])

In [30]:
# New combined file
df_merged.shape

(32399732, 30)

In [31]:
df_merged.head()

,order_id,user_id,order_number,orders_day_of_the_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,_merge,...,mean_price_ords,spending_flag,order_frequency,customer_frequency_flag,gender,state,customer_age,number_of_dependants,marital_status,annual_income
0,2539329,1,1,2,8,11.11,196,1,0,both,...,6.367797,Low spender,20.0,Regular customer,Female,Alabama,31,3,married,40423
1,2398795,1,2,3,7,15.00,196,1,1,both,...,6.367797,Low spender,20.0,Regular customer,Female,Alabama,31,3,married,40423
2,473747,1,3,3,12,21.00,196,1,1,both,...,6.367797,Low spender,20.0,Regular customer,Female,Alabama,31,3,married,40423
3,2254736,1,4,4,7,29.00,196,1,1,both,...,6.367797,Low spender,20.0,Regular customer,Female,Alabama,31,3,married,40423
4,431534,1,5,4,15,28.00,196,1,1,both,...,6.367797,Low spender,20.0,Regular customer,Female,Alabama,31,3,married,40423

In [32]:
df_merged.columns

Index(['order_id', 'user_id', 'order_number', 'orders_day_of_the_week',
       'order_hour_of_day', 'days_since_prior_order', 'product_id',
       'add_to_cart_order', 'reordered', '_merge', 'product_name', 'aisle_id',
       'department_id', 'prices', 'price_range_loc', 'busiest_day',
       'busiest_days', 'busiest_period_of_day', 'max_order', 'loyalty_flag',
       'mean_price_ords', 'spending_flag', 'order_frequency',
       'customer_frequency_flag', 'gender', 'state', 'customer_age',
       'number_of_dependants', 'marital_status', 'annual_income'],
      dtype='object')

In [33]:
df_merged['_merge'].value_counts()

both          32399732
right_only           0
left_only            0
Name: _merge, dtype: int64

In [35]:
# Export file
df_merged.to_pickle(os.path.join(path, 'Prepared Data', 'merge_data_visualizations_1.pkl'))